In [1]:
import numpy as np
import pandas as pd

In [2]:
sr1 = pd.Series([-4, 10, 9, -7, 3]) 
sr1

0    -4
1    10
2     9
3    -7
4     3
dtype: int64

In [3]:
sr1.dtype

dtype('int64')

In [4]:
sr2 = pd.Series([-4, 10, 9, -7, 3], index=['a','b','c','d','e'])

In [5]:
sr2

a    -4
b    10
c     9
d    -7
e     3
dtype: int64

In [6]:
sd = {'sunyoung':10000000, 'pyo':999999, 'kildong':9000000, 'bts':10000090}
sr3 = pd.Series(sd)

In [7]:
sr3

bts         10000090
kildong      9000000
pyo           999999
sunyoung    10000000
dtype: int64

In [8]:
sr3.name = '봉급'

In [9]:
sr3.index.name = '이름'

In [10]:
sr3

이름
bts         10000090
kildong      9000000
pyo           999999
sunyoung    10000000
Name: 봉급, dtype: int64

In [11]:
data = { "names": ["sunyoung", "sunyoung", "sunyoung", "jungjae", "jungjae"],
        "year": [2016, 2017, 2018, 2015, 2016],
        "points": [1.5, 1.7, 3.6, 2.4, 2.9] }

In [12]:
df = pd.DataFrame(data)

In [13]:
df

      names  points  year
0  sunyoung     1.5  2016
1  sunyoung     1.7  2017
2  sunyoung     3.6  2018
3   jungjae     2.4  2015
4   jungjae     2.9  2016

In [14]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
df.columns

Index(['names', 'points', 'year'], dtype='object')

In [16]:
df.values

array([['sunyoung', 1.5, 2016],
       ['sunyoung', 1.7, 2017],
       ['sunyoung', 3.6, 2018],
       ['jungjae', 2.4, 2015],
       ['jungjae', 2.9, 2016]], dtype=object)

In [17]:
df2 = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [18]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [19]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [20]:
df2.columns

Index(['year', 'names', 'points', 'penalty'], dtype='object')

In [21]:
df2.values

array([[2016, 'sunyoung', 1.5, nan],
       [2017, 'sunyoung', 1.7, nan],
       [2018, 'sunyoung', 3.6, nan],
       [2015, 'jungjae', 2.4, nan],
       [2016, 'jungjae', 2.9, nan]], dtype=object)

In [22]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2016.400000  2.420000
std       1.140175  0.864292
min    2015.000000  1.500000
25%    2016.000000  1.700000
50%    2016.000000  2.400000
75%    2017.000000  2.900000
max    2018.000000  3.600000

In [23]:
df2.describe

<bound method NDFrame.describe of        year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN>

In [24]:
data

{'names': ['sunyoung', 'sunyoung', 'sunyoung', 'jungjae', 'jungjae'],
 'points': [1.5, 1.7, 3.6, 2.4, 2.9],
 'year': [2016, 2017, 2018, 2015, 2016]}

In [25]:
df2

       year     names  points penalty
one    2016  sunyoung     1.5     NaN
two    2017  sunyoung     1.7     NaN
three  2018  sunyoung     3.6     NaN
four   2015   jungjae     2.4     NaN
five   2016   jungjae     2.9     NaN

In [26]:
df2['names']

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [27]:
df2['year']

one      2016
two      2017
three    2018
four     2015
five     2016
Name: year, dtype: int64

In [28]:
df2.names

one      sunyoung
two      sunyoung
three    sunyoung
four      jungjae
five      jungjae
Name: names, dtype: object

In [29]:
df2.year

one      2016
two      2017
three    2018
four     2015
five     2016
Name: year, dtype: int64

In [30]:
del df2['year' ]

In [32]:
# 에러
# del df2.names

In [34]:
df2

          names  points penalty
one    sunyoung     1.5     NaN
two    sunyoung     1.7     NaN
three  sunyoung     3.6     NaN
four    jungjae     2.4     NaN
five    jungjae     2.9     NaN

In [35]:
df2[ ['names', 'points']]

          names  points
one    sunyoung     1.5
two    sunyoung     1.7
three  sunyoung     3.6
four    jungjae     2.4
five    jungjae     2.9

In [36]:
df2[ ['names': 'points']]

SyntaxError: invalid syntax (<ipython-input-36-e3df6dc331f0>, line 1)

In [38]:
# df[1]

In [39]:
df[1:3]

      names  points  year
1  sunyoung     1.7  2017
2  sunyoung     3.6  2018

In [40]:
df2

          names  points penalty
one    sunyoung     1.5     NaN
two    sunyoung     1.7     NaN
three  sunyoung     3.6     NaN
four    jungjae     2.4     NaN
five    jungjae     2.9     NaN

In [41]:
df2[1:3]

          names  points penalty
two    sunyoung     1.7     NaN
three  sunyoung     3.6     NaN

In [42]:
df2

          names  points penalty
one    sunyoung     1.5     NaN
two    sunyoung     1.7     NaN
three  sunyoung     3.6     NaN
four    jungjae     2.4     NaN
five    jungjae     2.9     NaN

In [43]:
df2['two' : 'four']

          names  points penalty
two    sunyoung     1.7     NaN
three  sunyoung     3.6     NaN
four    jungjae     2.4     NaN